beforelight/IMRT10XX/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052CVL5B
mcu_data: ksdk2_0
processor_version: 7.0.1
pin_labels:
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: LED1, identifier: LED1}
- {pin_num: L6, pin_signal: WAKEUP, label: WAKEUP/WAKEUP/WAKEUP Used for bootloader/WAKEUP Used for bootloader/WAKEUP Used for bootloader/WAKEUP Used for bootloader,
  identifier: WAKEUP}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: TX, identifier: TX}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: RX, identifier: RX}
- {pin_num: M6, pin_signal: ONOFF, label: ONOFF, identifier: ONOFF}
- {pin_num: D9, pin_signal: GPIO_B0_10, label: BT_CFG6/PD, identifier: WRX;WR}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: BT_CFG7/PD, identifier: CSX;DC}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: DEBUG, identifier: DEBUG}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: DEBUG, identifier: DEBUG}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: ' PD/0_SPI/1_Serial Downloader', identifier: BT_PD_0_SPI__1_SerialDownloader}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: bee PD/0, identifier: BT_PD_0}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: CSI, identifier: SCL}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: CSI, identifier: SDA}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: keyboard}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: keyboard}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: keyboard}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: keyboard}
- {pin_num: F13, pin_signal: GPIO_AD_B0_08, label: keyboard JTAG_MOD}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: keyboard}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: keyboard}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: keyboard, identifier: PWDN}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: CD, identifier: CD}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: D2, identifier: D2}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: D0, identifier: D0}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: D3, identifier: D3}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: CLK, identifier: CLK}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: CMD, identifier: CMD}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: D1, identifier: DATA1;D1}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: SDA, identifier: SDA}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: SCL, identifier: SCL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    SWD();
    LED();
    DEBUG_UART1();
    DEBUG_UART2();
    WAKEUP();
    SD_CARD();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SWD:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: G10, peripheral: JTAG, signal: TRSTB, pin_signal: GPIO_AD_B0_11}
  - {pin_num: E14, peripheral: JTAG, signal: TMS, pin_signal: GPIO_AD_B0_06}
  - {pin_num: F12, peripheral: JTAG, signal: TCK, pin_signal: GPIO_AD_B0_07}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SWD
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SWD(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_06_JTAG_TMS,          /* GPIO_AD_B0_06 is configured as JTAG_TMS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_07_JTAG_TCK,          /* GPIO_AD_B0_07 is configured as JTAG_TCK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_11_JTAG_TRSTB,        /* GPIO_AD_B0_11 is configured as JTAG_TRSTB */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LED:
- options: {callFromInitBoot: 'true', prefix: '', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: M11, peripheral: GPIO1, signal: 'gpio_io, 02', pin_signal: GPIO_AD_B0_02, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LED
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LED(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  /* GPIO configuration of LED1 on GPIO_AD_B0_02 (pin M11) */
  gpio_pin_config_t LED1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_02 (pin M11) */
  GPIO_PinInit(GPIO1, 2U, &LED1_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_02_GPIO1_IO02,        /* GPIO_AD_B0_02 is configured as GPIO1_IO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


