beforelight/IMRT10XX/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
FLEXIO8080:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D7, peripheral: FLEXIO2, signal: 'IO, 00', pin_signal: GPIO_B0_00, direction: OUTPUT}
  - {pin_num: E7, peripheral: FLEXIO2, signal: 'IO, 01', pin_signal: GPIO_B0_01, direction: OUTPUT}
  - {pin_num: E8, peripheral: FLEXIO2, signal: 'IO, 02', pin_signal: GPIO_B0_02, direction: OUTPUT}
  - {pin_num: D8, peripheral: FLEXIO2, signal: 'IO, 03', pin_signal: GPIO_B0_03, direction: OUTPUT}
  - {pin_num: C8, peripheral: FLEXIO2, signal: 'IO, 04', pin_signal: GPIO_B0_04, direction: OUTPUT}
  - {pin_num: B8, peripheral: FLEXIO2, signal: 'IO, 05', pin_signal: GPIO_B0_05, direction: OUTPUT}
  - {pin_num: A8, peripheral: FLEXIO2, signal: 'IO, 06', pin_signal: GPIO_B0_06, direction: OUTPUT}
  - {pin_num: A9, peripheral: FLEXIO2, signal: 'IO, 07', pin_signal: GPIO_B0_07, direction: OUTPUT}
  - {pin_num: D9, peripheral: FLEXIO2, signal: 'IO, 10', pin_signal: GPIO_B0_10, identifier: WR, direction: OUTPUT}
  - {pin_num: A10, peripheral: GPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_B0_11, identifier: DC, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : FLEXIO8080
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void FLEXIO8080(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  /* GPIO configuration of DC on GPIO_B0_11 (pin A10) */
  gpio_pin_config_t DC_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_11 (pin A10) */
  GPIO_PinInit(GPIO2, 11U, &DC_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_00_FLEXIO2_FLEXIO00,     /* GPIO_B0_00 is configured as FLEXIO2_FLEXIO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_01_FLEXIO2_FLEXIO01,     /* GPIO_B0_01 is configured as FLEXIO2_FLEXIO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_02_FLEXIO2_FLEXIO02,     /* GPIO_B0_02 is configured as FLEXIO2_FLEXIO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_03_FLEXIO2_FLEXIO03,     /* GPIO_B0_03 is configured as FLEXIO2_FLEXIO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_04_FLEXIO2_FLEXIO04,     /* GPIO_B0_04 is configured as FLEXIO2_FLEXIO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_05_FLEXIO2_FLEXIO05,     /* GPIO_B0_05 is configured as FLEXIO2_FLEXIO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_06_FLEXIO2_FLEXIO06,     /* GPIO_B0_06 is configured as FLEXIO2_FLEXIO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_07_FLEXIO2_FLEXIO07,     /* GPIO_B0_07 is configured as FLEXIO2_FLEXIO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_10_FLEXIO2_FLEXIO10,     /* GPIO_B0_10 is configured as FLEXIO2_FLEXIO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_11_GPIO2_IO11,           /* GPIO_B0_11 is configured as GPIO2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
IO8080:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D7, peripheral: GPIO2, signal: 'gpio_io, 00', pin_signal: GPIO_B0_00, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: E7, peripheral: GPIO2, signal: 'gpio_io, 01', pin_signal: GPIO_B0_01, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: E8, peripheral: GPIO2, signal: 'gpio_io, 02', pin_signal: GPIO_B0_02, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: D8, peripheral: GPIO2, signal: 'gpio_io, 03', pin_signal: GPIO_B0_03, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: C8, peripheral: GPIO2, signal: 'gpio_io, 04', pin_signal: GPIO_B0_04, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: B8, peripheral: GPIO2, signal: 'gpio_io, 05', pin_signal: GPIO_B0_05, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: A8, peripheral: GPIO2, signal: 'gpio_io, 06', pin_signal: GPIO_B0_06, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: A9, peripheral: GPIO2, signal: 'gpio_io, 07', pin_signal: GPIO_B0_07, direction: OUTPUT, speed: MHZ_200, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: D9, peripheral: GPIO2, signal: 'gpio_io, 10', pin_signal: GPIO_B0_10, identifier: WR, direction: OUTPUT, gpio_init_state: 'true', speed: MHZ_200, drive_strength: R0_7,
    slew_rate: Fast}
  - {pin_num: A10, peripheral: GPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_B0_11, identifier: DC, direction: OUTPUT, gpio_init_state: 'true', speed: MHZ_200, drive_strength: R0_7,
    slew_rate: Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

